
## :x: Apply Failed

[CI link](https://github.com/ikigaikintore/ikigaikintore/actions/runs/7965804627)



<pre><code>Error: Error when reading or editing Project Service gig-japan-398904/serviceusage.googleapis.com: Error disabling service &#34;serviceusage.googleapis.com&#34; for project &#34;gig-japan-398904&#34;: googleapi: Error 400: The service serviceusage.googleapis.com is depended on by the following active service(s): cloudapis.googleapis.com; Please specify disable_dependent_services=true if you want to proceed with disabling all services.
Help Token: AX4KC-jmraLD8S89wRq3e2-NISifWAf0P3QtloVyWoHfmlVJ1ml1FrW5jNA0ns5rJB5FaDAOQJ_8s7a91i4-uZTWdFFNSBcdZo5Q8GQU0hBCsdYY
Details:
[
  {
    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.PreconditionFailure&#34;,
    &#34;violations&#34;: [
      {
        &#34;subject&#34;: &#34;?error_code=100001\u0026service_name=serviceusage.googleapis.com\u0026services=cloudapis.googleapis.com&#34;,
        &#34;type&#34;: &#34;googleapis.com&#34;
      }
    ]
  },
  {
    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.ErrorInfo&#34;,
    &#34;domain&#34;: &#34;serviceusage.googleapis.com&#34;,
    &#34;metadata&#34;: {
      &#34;service_name&#34;: &#34;serviceusage.googleapis.com&#34;,
      &#34;services&#34;: &#34;cloudapis.googleapis.com&#34;
    },
    &#34;reason&#34;: &#34;COMMON_SU_SERVICE_HAS_DEPENDENT_SERVICES&#34;
  }
]
, failedPrecondition


Error: Error when reading or editing Project Service gig-japan-398904/firebase.googleapis.com: Error disabling service &#34;firebase.googleapis.com&#34; for project &#34;gig-japan-398904&#34;: googleapi: Error 400: The service firebase.googleapis.com is depended on by the following active service(s): firebasehosting.googleapis.com; Please specify disable_dependent_services=true if you want to proceed with disabling all services.
Help Token: AX4KC-jwtciV7DfQEX29mFEcU_XAkzNqRlXcPdloIPqXvY_9IsoA98LXzLet4X0vsokL2FzwGkbsJ3nSV8_c4iJkvGo4rmlL4B7JK42wP-SCsetG
Details:
[
  {
    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.PreconditionFailure&#34;,
    &#34;violations&#34;: [
      {
        &#34;subject&#34;: &#34;?error_code=100001\u0026service_name=firebase.googleapis.com\u0026services=firebasehosting.googleapis.com&#34;,
        &#34;type&#34;: &#34;googleapis.com&#34;
      }
    ]
  },
  {
    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.ErrorInfo&#34;,
    &#34;domain&#34;: &#34;serviceusage.googleapis.com&#34;,
    &#34;metadata&#34;: {
      &#34;service_name&#34;: &#34;firebase.googleapis.com&#34;,
      &#34;services&#34;: &#34;firebasehosting.googleapis.com&#34;
    },
    &#34;reason&#34;: &#34;COMMON_SU_SERVICE_HAS_DEPENDENT_SERVICES&#34;
  }
]
, failedPrecondition


Error: Error when reading or editing Project Service gig-japan-398904/serviceusage.googleapis.com: Error disabling service &#34;serviceusage.googleapis.com&#34; for project &#34;gig-japan-398904&#34;: googleapi: Error 400: The service serviceusage.googleapis.com is depended on by the following active service(s): cloudapis.googleapis.com; Please specify disable_dependent_services=true if you want to proceed with disabling all services.
Help Token: AX4KC-jb3vk0Jh4zmgt568iqN3xA9m-J3s_SbQLt9J9gotYuwVeavg_Yh9O7nMgbbM68SSagX7O6NzKCUu-t5z6CAWlzw_hI2BE03BudZEwkjUWq
Details:
[
  {
    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.PreconditionFailure&#34;,
    &#34;violations&#34;: [
      {
        &#34;subject&#34;: &#34;?error_code=100001\u0026service_name=serviceusage.googleapis.com\u0026services=cloudapis.googleapis.com&#34;,
        &#34;type&#34;: &#34;googleapis.com&#34;
      }
    ]
  },
  {
    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.ErrorInfo&#34;,
    &#34;domain&#34;: &#34;serviceusage.googleapis.com&#34;,
    &#34;metadata&#34;: {
      &#34;service_name&#34;: &#34;serviceusage.googleapis.com&#34;,
      &#34;services&#34;: &#34;cloudapis.googleapis.com&#34;
    },
    &#34;reason&#34;: &#34;COMMON_SU_SERVICE_HAS_DEPENDENT_SERVICES&#34;
  }
]
, failedPrecondition


Error: Error when reading or editing Project Service gig-japan-398904/firebase.googleapis.com: Error disabling service &#34;firebase.googleapis.com&#34; for project &#34;gig-japan-398904&#34;: googleapi: Error 400: The service firebase.googleapis.com is depended on by the following active service(s): firebasehosting.googleapis.com; Please specify disable_dependent_services=true if you want to proceed with disabling all services.
Help Token: AX4KC-hyRYx9iDJCs5ysZHbQutD4sYgJ8dF1kgBs1j3_ta0shUoNSnYIXn4VosbZnC4LL2_3r2aemgQqmisICd9H7lbrClTU1_9G9Io8DVNZKbLx
Details:
[
  {
    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.PreconditionFailure&#34;,
    &#34;violations&#34;: [
      {
        &#34;subject&#34;: &#34;?error_code=100001\u0026service_name=firebase.googleapis.com\u0026services=firebasehosting.googleapis.com&#34;,
        &#34;type&#34;: &#34;googleapis.com&#34;
      }
    ]
  },
  {
    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.ErrorInfo&#34;,
    &#34;domain&#34;: &#34;serviceusage.googleapis.com&#34;,
    &#34;metadata&#34;: {
      &#34;service_name&#34;: &#34;firebase.googleapis.com&#34;,
      &#34;services&#34;: &#34;firebasehosting.googleapis.com&#34;
    },
    &#34;reason&#34;: &#34;COMMON_SU_SERVICE_HAS_DEPENDENT_SERVICES&#34;
  }
]
, failedPrecondition


Error: Request `Create IAM Members roles/secretsmanager.secretAccessor serviceAccount:proxy-sa@gig-japan-398904.iam.gserviceaccount.com for project &#34;gig-japan-398904&#34;` returned error: Batch request and retried single request &#34;Create IAM Members roles/secretsmanager.secretAccessor serviceAccount:proxy-sa@gig-japan-398904.iam.gserviceaccount.com for project \&#34;gig-japan-398904\&#34;&#34; both failed. Final error: Error applying IAM policy for project &#34;gig-japan-398904&#34;: Error setting IAM policy for project &#34;gig-japan-398904&#34;: googleapi: Error 400: Role roles/secretsmanager.secretAccessor is not supported for this resource., badRequest

  with google_project_iam_member.proxy-sa-roles[&#34;roles/secretsmanager.secretAccessor&#34;],
  on proxy.tf line 14, in resource &#34;google_project_iam_member&#34; &#34;proxy-sa-roles&#34;:
  14: resource &#34;google_project_iam_member&#34; &#34;proxy-sa-roles&#34; {

::debug::Terraform exited with code 1.
::debug::stdout: google_project_service.frontend-api-resources[&#34;identitytoolkit.googleapis.com&#34;]: Refreshing state... [id=gig-japan-398904/identitytoolkit.googleapis.com]%0Agoogle_project_service.firebase_apis[&#34;serviceusage.googleapis.com&#34;]: Refreshing state... [id=gig-japan-398904/serviceusage.googleapis.com]%0Agoogle_project_service.firebase_apis[&#34;firebase.googleapis.com&#34;]: Refreshing state... [id=gig-japan-398904/firebase.googleapis.com]%0Agoogle_project_service.frontend-api-resources[&#34;serviceusage.googleapis.com&#34;]: Refreshing state... [id=gig-japan-398904/serviceusage.googleapis.com]%0Agoogle_service_account.gitops-sa: Refreshing state... [id=projects/gig-japan-398904/serviceAccounts/terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_service.firebase-apis[&#34;serviceusage.googleapis.com&#34;]: Refreshing state... [id=gig-japan-398904/serviceusage.googleapis.com]%0Agoogle_project_service.firebase-apis[&#34;firebase.googleapis.com&#34;]: Refreshing state... [id=gig-japan-398904/firebase.googleapis.com]%0Agoogle_service_account.backend-sa: Refreshing state... [id=projects/gig-japan-398904/serviceAccounts/backend-sa@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_service.frontend-api-resources[&#34;firestore.googleapis.com&#34;]: Refreshing state... [id=gig-japan-398904/firestore.googleapis.com]%0Agoogle_storage_bucket.frontend-bucket: Refreshing state... [id=web-iki]%0Agoogle_project_service.api-resources[&#34;artifactregistry.googleapis.com&#34;]: Refreshing state... [id=gig-japan-398904/artifactregistry.googleapis.com]%0Agoogle_iam_workload_identity_pool.gitops-github-identity-pool: Refreshing state... [id=projects/gig-japan-398904/locations/global/workloadIdentityPools/gitops-github]%0Agoogle_service_account.frontend-sa: Refreshing state... [id=projects/gig-japan-398904/serviceAccounts/frontend-sa@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_service.backend-api-resources[&#34;run.googleapis.com&#34;]: Refreshing state... [id=gig-japan-398904/run.googleapis.com]%0Agoogle_project_iam_member.gitops-sa-roles[&#34;roles/artifactregistry.writer&#34;]: Refreshing state... [id=gig-japan-398904/roles/artifactregistry.writer/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_service.backend-api-resources[&#34;secretmanager.googleapis.com&#34;]: Refreshing state... [id=gig-japan-398904/secretmanager.googleapis.com]%0Agoogle_artifact_registry_repository.artifact-repository: Refreshing state... [id=projects/gig-japan-398904/locations/asia-northeast1/repositories/ikigai]%0Agoogle_project_iam_member.gitops-sa-roles[&#34;roles/iam.workloadIdentityUser&#34;]: Refreshing state... [id=gig-japan-398904/roles/iam.workloadIdentityUser/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.gitops-sa-roles[&#34;roles/secretmanager.admin&#34;]: Refreshing state... [id=gig-japan-398904/roles/secretmanager.admin/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.gitops-sa-roles[&#34;roles/storage.admin&#34;]: Refreshing state... [id=gig-japan-398904/roles/storage.admin/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.backend-sa-roles[&#34;roles/run.developer&#34;]: Refreshing state... [id=gig-japan-398904/roles/run.developer/serviceAccount:backend-sa@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.gitops-sa-roles[&#34;roles/editor&#34;]: Refreshing state... [id=gig-japan-398904/roles/editor/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.backend-sa-roles[&#34;roles/iam.serviceAccountTokenCreator&#34;]: Refreshing state... [id=gig-japan-398904/roles/iam.serviceAccountTokenCreator/serviceAccount:backend-sa@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.backend-sa-roles[&#34;roles/secretmanager.secretAccessor&#34;]: Refreshing state... [id=gig-japan-398904/roles/secretmanager.secretAccessor/serviceAccount:backend-sa@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.backend-sa-roles[&#34;roles/iam.serviceAccountUser&#34;]: Refreshing state... [id=gig-japan-398904/roles/iam.serviceAccountUser/serviceAccount:backend-sa@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.gitops-sa-binding: Refreshing state... [id=gig-japan-398904/roles/iam.workloadIdentityUser/principal://iam.googleapis.com/projects/139527520332/locations/global/workloadIdentityPools/gitops-github/subject/ikigaikintore/ikigaikintore]%0Agoogle_iam_workload_identity_pool_provider.gitops-github-pool-provider: Refreshing state... [id=projects/gig-japan-398904/locations/global/workloadIdentityPools/gitops-github/providers/gitops-github-pool]%0Agoogle_project_iam_member.frontend-sa-roles[&#34;roles/iam.serviceAccountTokenCreator&#34;]: Refreshing state... [id=gig-japan-398904/roles/iam.serviceAccountTokenCreator/serviceAccount:frontend-sa@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.frontend-sa-roles[&#34;roles/run.developer&#34;]: Refreshing state... [id=gig-japan-398904/roles/run.developer/serviceAccount:frontend-sa@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.frontend-sa-roles[&#34;roles/secretmanager.secretAccessor&#34;]: Refreshing state... [id=gig-japan-398904/roles/secretmanager.secretAccessor/serviceAccount:frontend-sa@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.frontend-sa-roles[&#34;roles/iam.serviceAccountUser&#34;]: Refreshing state... [id=gig-japan-398904/roles/iam.serviceAccountUser/serviceAccount:frontend-sa@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_secret_manager_secret.frontend-secrets[&#34;environment&#34;]: Refreshing state... [id=projects/gig-japan-398904/secrets/environment]%0Agoogle_secret_manager_secret.frontend-secrets[&#34;firebase_app_id&#34;]: Refreshing state... [id=projects/gig-japan-398904/secrets/firebase_app_id]%0Agoogle_secret_manager_secret.frontend-secrets[&#34;user_auth&#34;]: Refreshing state... [id=projects/gig-japan-398904/secrets/user_auth]%0Agoogle_secret_manager_secret.frontend-secrets[&#34;base_endpoint&#34;]: Refreshing state... [id=projects/gig-japan-398904/secrets/base_endpoint]%0Agoogle_secret_manager_secret.frontend-secrets[&#34;firebase_messaging_sender_id&#34;]: Refreshing state... [id=projects/gig-japan-398904/secrets/firebase_messaging_sender_id]%0Agoogle_secret_manager_secret.frontend-secrets[&#34;firebase_storage_bucket&#34;]: Refreshing state... [id=projects/gig-japan-398904/secrets/firebase_storage_bucket]%0Agoogle_secret_manager_secret.frontend-secrets[&#34;firebase_auth_domain&#34;]: Refreshing state... [id=projects/gig-japan-398904/secrets/firebase_auth_domain]%0Agoogle_secret_manager_secret.frontend-secrets[&#34;firebase_api_key&#34;]: Refreshing state... [id=projects/gig-japan-398904/secrets/firebase_api_key]%0Agoogle_secret_manager_secret.frontend-secrets[&#34;firebase_project_id&#34;]: Refreshing state... [id=projects/gig-japan-398904/secrets/firebase_project_id]%0Agoogle_secret_manager_secret.backend-sa-secret[&#34;weather_api_key&#34;]: Refreshing state... [id=projects/gig-japan-398904/secrets/weather_api_key]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  &#43; create%0A  ~ update in-place%0A  - destroy%0A%0ATerraform will perform the following actions:%0A%0A  # google_artifact_registry_repository.artifact-repository will be updated in-place%0A  ~ resource &#34;google_artifact_registry_repository&#34; &#34;artifact-repository&#34; {%0A        id               = &#34;projects/gig-japan-398904/locations/asia-northeast1/repositories/ikigai&#34;%0A        name             = &#34;ikigai&#34;%0A        # (10 unchanged attributes hidden)%0A%0A      &#43; docker_config {%0A          &#43; immutable_tags = false%0A        }%0A    }%0A%0A  # google_project_iam_member.proxy-sa-roles[&#34;roles/run.invoker&#34;] will be created%0A  &#43; resource &#34;google_project_iam_member&#34; &#34;proxy-sa-roles&#34; {%0A      &#43; etag    = (known after apply)%0A      &#43; id      = (known after apply)%0A      &#43; member  = (known after apply)%0A      &#43; project = &#34;gig-japan-398904&#34;%0A      &#43; role    = &#34;roles/run.invoker&#34;%0A    }%0A%0A  # google_project_iam_member.proxy-sa-roles[&#34;roles/secretsmanager.secretAccessor&#34;] will be created%0A  &#43; resource &#34;google_project_iam_member&#34; &#34;proxy-sa-roles&#34; {%0A      &#43; etag    = (known after apply)%0A      &#43; id      = (known after apply)%0A      &#43; member  = (known after apply)%0A      &#43; project = &#34;gig-japan-398904&#34;%0A      &#43; role    = &#34;roles/secretsmanager.secretAccessor&#34;%0A    }%0A%0A  # google_project_service.firebase-apis[&#34;firebase.googleapis.com&#34;] will be destroyed%0A  # (because google_project_service.firebase-apis is not in configuration)%0A  - resource &#34;google_project_service&#34; &#34;firebase-apis&#34; {%0A      - disable_on_destroy = true -&gt; null%0A      - id                 = &#34;gig-japan-398904/firebase.googleapis.com&#34; -&gt; null%0A      - project            = &#34;gig-japan-398904&#34; -&gt; null%0A      - service            = &#34;firebase.googleapis.com&#34; -&gt; null%0A    }%0A%0A  # google_project_service.firebase-apis[&#34;serviceusage.googleapis.com&#34;] will be destroyed%0A  # (because google_project_service.firebase-apis is not in configuration)%0A  - resource &#34;google_project_service&#34; &#34;firebase-apis&#34; {%0A      - disable_on_destroy = true -&gt; null%0A      - id                 = &#34;gig-japan-398904/serviceusage.googleapis.com&#34; -&gt; null%0A      - project            = &#34;gig-japan-398904&#34; -&gt; null%0A      - service            = &#34;serviceusage.googleapis.com&#34; -&gt; null%0A    }%0A%0A  # google_project_service.firebase_apis[&#34;firebase.googleapis.com&#34;] will be destroyed%0A  # (because google_project_service.firebase_apis is not in configuration)%0A  - resource &#34;google_project_service&#34; &#34;firebase_apis&#34; {%0A      - disable_on_destroy = true -&gt; null%0A      - id                 = &#34;gig-japan-398904/firebase.googleapis.com&#34; -&gt; null%0A      - project            = &#34;gig-japan-398904&#34; -&gt; null%0A      - service            = &#34;firebase.googleapis.com&#34; -&gt; null%0A    }%0A%0A  # google_project_service.firebase_apis[&#34;serviceusage.googleapis.com&#34;] will be destroyed%0A  # (because google_project_service.firebase_apis is not in configuration)%0A  - resource &#34;google_project_service&#34; &#34;firebase_apis&#34; {%0A      - disable_on_destroy = true -&gt; null%0A      - id                 = &#34;gig-japan-398904/serviceusage.googleapis.com&#34; -&gt; null%0A      - project            = &#34;gig-japan-398904&#34; -&gt; null%0A      - service            = &#34;serviceusage.googleapis.com&#34; -&gt; null%0A    }%0A%0A  # google_service_account.proxy-sa will be created%0A  &#43; resource &#34;google_service_account&#34; &#34;proxy-sa&#34; {%0A      &#43; account_id   = &#34;proxy-sa&#34;%0A      &#43; disabled     = false%0A      &#43; display_name = &#34;proxy-sa&#34;%0A      &#43; email        = (known after apply)%0A      &#43; id           = (known after apply)%0A      &#43; member       = (known after apply)%0A      &#43; name         = (known after apply)%0A      &#43; project      = &#34;gig-japan-398904&#34;%0A      &#43; unique_id    = (known after apply)%0A    }%0A%0APlan: 3 to add, 1 to change, 4 to destroy.%0Agoogle_project_service.firebase-apis[&#34;firebase.googleapis.com&#34;]: Destroying... [id=gig-japan-398904/firebase.googleapis.com]%0Agoogle_project_service.firebase_apis[&#34;serviceusage.googleapis.com&#34;]: Destroying... [id=gig-japan-398904/serviceusage.googleapis.com]%0Agoogle_project_service.firebase-apis[&#34;serviceusage.googleapis.com&#34;]: Destroying... [id=gig-japan-398904/serviceusage.googleapis.com]%0Agoogle_project_service.firebase_apis[&#34;firebase.googleapis.com&#34;]: Destroying... [id=gig-japan-398904/firebase.googleapis.com]%0Agoogle_service_account.proxy-sa: Creating...%0Agoogle_artifact_registry_repository.artifact-repository: Modifying... [id=projects/gig-japan-398904/locations/asia-northeast1/repositories/ikigai]%0Agoogle_artifact_registry_repository.artifact-repository: Modifications complete after 2s [id=projects/gig-japan-398904/locations/asia-northeast1/repositories/ikigai]%0Agoogle_service_account.proxy-sa: Creation complete after 2s [id=projects/gig-japan-398904/serviceAccounts/proxy-sa@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.proxy-sa-roles[&#34;roles/secretsmanager.secretAccessor&#34;]: Creating...%0Agoogle_project_iam_member.proxy-sa-roles[&#34;roles/run.invoker&#34;]: Creating...%0Agoogle_project_iam_member.proxy-sa-roles[&#34;roles/run.invoker&#34;]: Creation complete after 8s [id=gig-japan-398904/roles/run.invoker/serviceAccount:proxy-sa@gig-japan-398904.iam.gserviceaccount.com]%0A
::debug::stderr: %0AError: Error when reading or editing Project Service gig-japan-398904/serviceusage.googleapis.com: Error disabling service &#34;serviceusage.googleapis.com&#34; for project &#34;gig-japan-398904&#34;: googleapi: Error 400: The service serviceusage.googleapis.com is depended on by the following active service(s): cloudapis.googleapis.com; Please specify disable_dependent_services=true if you want to proceed with disabling all services.%0AHelp Token: AX4KC-jmraLD8S89wRq3e2-NISifWAf0P3QtloVyWoHfmlVJ1ml1FrW5jNA0ns5rJB5FaDAOQJ_8s7a91i4-uZTWdFFNSBcdZo5Q8GQU0hBCsdYY%0ADetails:%0A[%0A  {%0A    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.PreconditionFailure&#34;,%0A    &#34;violations&#34;: [%0A      {%0A        &#34;subject&#34;: &#34;?error_code=100001\u0026service_name=serviceusage.googleapis.com\u0026services=cloudapis.googleapis.com&#34;,%0A        &#34;type&#34;: &#34;googleapis.com&#34;%0A      }%0A    ]%0A  },%0A  {%0A    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.ErrorInfo&#34;,%0A    &#34;domain&#34;: &#34;serviceusage.googleapis.com&#34;,%0A    &#34;metadata&#34;: {%0A      &#34;service_name&#34;: &#34;serviceusage.googleapis.com&#34;,%0A      &#34;services&#34;: &#34;cloudapis.googleapis.com&#34;%0A    },%0A    &#34;reason&#34;: &#34;COMMON_SU_SERVICE_HAS_DEPENDENT_SERVICES&#34;%0A  }%0A]%0A, failedPrecondition%0A%0A%0AError: Error when reading or editing Project Service gig-japan-398904/firebase.googleapis.com: Error disabling service &#34;firebase.googleapis.com&#34; for project &#34;gig-japan-398904&#34;: googleapi: Error 400: The service firebase.googleapis.com is depended on by the following active service(s): firebasehosting.googleapis.com; Please specify disable_dependent_services=true if you want to proceed with disabling all services.%0AHelp Token: AX4KC-jwtciV7DfQEX29mFEcU_XAkzNqRlXcPdloIPqXvY_9IsoA98LXzLet4X0vsokL2FzwGkbsJ3nSV8_c4iJkvGo4rmlL4B7JK42wP-SCsetG%0ADetails:%0A[%0A  {%0A    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.PreconditionFailure&#34;,%0A    &#34;violations&#34;: [%0A      {%0A        &#34;subject&#34;: &#34;?error_code=100001\u0026service_name=firebase.googleapis.com\u0026services=firebasehosting.googleapis.com&#34;,%0A        &#34;type&#34;: &#34;googleapis.com&#34;%0A      }%0A    ]%0A  },%0A  {%0A    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.ErrorInfo&#34;,%0A    &#34;domain&#34;: &#34;serviceusage.googleapis.com&#34;,%0A    &#34;metadata&#34;: {%0A      &#34;service_name&#34;: &#34;firebase.googleapis.com&#34;,%0A      &#34;services&#34;: &#34;firebasehosting.googleapis.com&#34;%0A    },%0A    &#34;reason&#34;: &#34;COMMON_SU_SERVICE_HAS_DEPENDENT_SERVICES&#34;%0A  }%0A]%0A, failedPrecondition%0A%0A%0AError: Error when reading or editing Project Service gig-japan-398904/serviceusage.googleapis.com: Error disabling service &#34;serviceusage.googleapis.com&#34; for project &#34;gig-japan-398904&#34;: googleapi: Error 400: The service serviceusage.googleapis.com is depended on by the following active service(s): cloudapis.googleapis.com; Please specify disable_dependent_services=true if you want to proceed with disabling all services.%0AHelp Token: AX4KC-jb3vk0Jh4zmgt568iqN3xA9m-J3s_SbQLt9J9gotYuwVeavg_Yh9O7nMgbbM68SSagX7O6NzKCUu-t5z6CAWlzw_hI2BE03BudZEwkjUWq%0ADetails:%0A[%0A  {%0A    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.PreconditionFailure&#34;,%0A    &#34;violations&#34;: [%0A      {%0A        &#34;subject&#34;: &#34;?error_code=100001\u0026service_name=serviceusage.googleapis.com\u0026services=cloudapis.googleapis.com&#34;,%0A        &#34;type&#34;: &#34;googleapis.com&#34;%0A      }%0A    ]%0A  },%0A  {%0A    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.ErrorInfo&#34;,%0A    &#34;domain&#34;: &#34;serviceusage.googleapis.com&#34;,%0A    &#34;metadata&#34;: {%0A      &#34;service_name&#34;: &#34;serviceusage.googleapis.com&#34;,%0A      &#34;services&#34;: &#34;cloudapis.googleapis.com&#34;%0A    },%0A    &#34;reason&#34;: &#34;COMMON_SU_SERVICE_HAS_DEPENDENT_SERVICES&#34;%0A  }%0A]%0A, failedPrecondition%0A%0A%0AError: Error when reading or editing Project Service gig-japan-398904/firebase.googleapis.com: Error disabling service &#34;firebase.googleapis.com&#34; for project &#34;gig-japan-398904&#34;: googleapi: Error 400: The service firebase.googleapis.com is depended on by the following active service(s): firebasehosting.googleapis.com; Please specify disable_dependent_services=true if you want to proceed with disabling all services.%0AHelp Token: AX4KC-hyRYx9iDJCs5ysZHbQutD4sYgJ8dF1kgBs1j3_ta0shUoNSnYIXn4VosbZnC4LL2_3r2aemgQqmisICd9H7lbrClTU1_9G9Io8DVNZKbLx%0ADetails:%0A[%0A  {%0A    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.PreconditionFailure&#34;,%0A    &#34;violations&#34;: [%0A      {%0A        &#34;subject&#34;: &#34;?error_code=100001\u0026service_name=firebase.googleapis.com\u0026services=firebasehosting.googleapis.com&#34;,%0A        &#34;type&#34;: &#34;googleapis.com&#34;%0A      }%0A    ]%0A  },%0A  {%0A    &#34;@type&#34;: &#34;type.googleapis.com/google.rpc.ErrorInfo&#34;,%0A    &#34;domain&#34;: &#34;serviceusage.googleapis.com&#34;,%0A    &#34;metadata&#34;: {%0A      &#34;service_name&#34;: &#34;firebase.googleapis.com&#34;,%0A      &#34;services&#34;: &#34;firebasehosting.googleapis.com&#34;%0A    },%0A    &#34;reason&#34;: &#34;COMMON_SU_SERVICE_HAS_DEPENDENT_SERVICES&#34;%0A  }%0A]%0A, failedPrecondition%0A%0A%0AError: Request `Create IAM Members roles/secretsmanager.secretAccessor serviceAccount:proxy-sa@gig-japan-398904.iam.gserviceaccount.com for project &#34;gig-japan-398904&#34;` returned error: Batch request and retried single request &#34;Create IAM Members roles/secretsmanager.secretAccessor serviceAccount:proxy-sa@gig-japan-398904.iam.gserviceaccount.com for project \&#34;gig-japan-398904\&#34;&#34; both failed. Final error: Error applying IAM policy for project &#34;gig-japan-398904&#34;: Error setting IAM policy for project &#34;gig-japan-398904&#34;: googleapi: Error 400: Role roles/secretsmanager.secretAccessor is not supported for this resource., badRequest%0A%0A  with google_project_iam_member.proxy-sa-roles[&#34;roles/secretsmanager.secretAccessor&#34;],%0A  on proxy.tf line 14, in resource &#34;google_project_iam_member&#34; &#34;proxy-sa-roles&#34;:%0A  14: resource &#34;google_project_iam_member&#34; &#34;proxy-sa-roles&#34; {%0A%0A
::debug::exitcode: 1
::error::Terraform exited with code 1.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
[command]/home/runner/work/_temp/1ef81430-206b-4753-8552-dba0fef37790/terraform-bin apply -input=false -auto-approve -lock=false -no-color
google_project_service.frontend-api-resources["identitytoolkit.googleapis.com"]: Refreshing state... [id=gig-japan-398904/identitytoolkit.googleapis.com]
google_project_service.firebase_apis["serviceusage.googleapis.com"]: Refreshing state... [id=gig-japan-398904/serviceusage.googleapis.com]
google_project_service.firebase_apis["firebase.googleapis.com"]: Refreshing state... [id=gig-japan-398904/firebase.googleapis.com]
google_project_service.frontend-api-resources["serviceusage.googleapis.com"]: Refreshing state... [id=gig-japan-398904/serviceusage.googleapis.com]
google_service_account.gitops-sa: Refreshing state... [id=projects/gig-japan-398904/serviceAccounts/terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]
google_project_service.firebase-apis["serviceusage.googleapis.com"]: Refreshing state... [id=gig-japan-398904/serviceusage.googleapis.com]
google_project_service.firebase-apis["firebase.googleapis.com"]: Refreshing state... [id=gig-japan-398904/firebase.googleapis.com]
google_service_account.backend-sa: Refreshing state... [id=projects/gig-japan-398904/serviceAccounts/backend-sa@gig-japan-398904.iam.gserviceaccount.com]
google_project_service.frontend-api-resources["firestore.googleapis.com"]: Refreshing state... [id=gig-japan-398904/firestore.googleapis.com]
google_storage_bucket.frontend-bucket: Refreshing state... [id=web-iki]
google_project_service.api-resources["artifactregistry.googleapis.com"]: Refreshing state... [id=gig-japan-398904/artifactregistry.googleapis.com]
google_iam_workload_identity_pool.gitops-github-identity-pool: Refreshing state... [id=projects/gig-japan-398904/locations/global/workloadIdentityPools/gitops-github]
google_service_account.frontend-sa: Refreshing state... [id=projects/gig-japan-398904/serviceAccounts/frontend-sa@gig-japan-398904.iam.gserviceaccount.com]
google_project_service.backend-api-resources["run.googleapis.com"]: Refreshing state... [id=gig-japan-398904/run.googleapis.com]
google_project_iam_member.gitops-sa-roles["roles/artifactregistry.writer"]: Refreshing state... [id=gig-japan-398904/roles/artifactregistry.writer/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]
google_project_service.backend-api-resources["secretmanager.googleapis.com"]: Refreshing state... [id=gig-japan-398904/secretmanager.googleapis.com]
google_artifact_registry_repository.artifact-repository: Refreshing state... [id=projects/gig-japan-398904/locations/asia-northeast1/repositories/ikigai]
google_project_iam_member.gitops-sa-roles["roles/iam.workloadIdentityUser"]: Refreshing state... [id=gig-japan-398904/roles/iam.workloadIdentityUser/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]
google_project_iam_member.gitops-sa-roles["roles/secretmanager.admin"]: Refreshing state... [id=gig-japan-398904/roles/secretmanager.admin/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]
google_project_iam_member.gitops-sa-roles["roles/storage.admin"]: Refreshing state... [id=gig-japan-398904/roles/storage.admin/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]
google_project_iam_member.backend-sa-roles["roles/run.developer"]: Refreshing state... [id=gig-japan-398904/roles/run.developer/serviceAccount:backend-sa@gig-japan-398904.iam.gserviceaccount.com]
google_project_iam_member.gitops-sa-roles["roles/editor"]: Refreshing state... [id=gig-japan-398904/roles/editor/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]
google_project_iam_member.backend-sa-roles["roles/iam.serviceAccountTokenCreator"]: Refreshing state... [id=gig-japan-398904/roles/iam.serviceAccountTokenCreator/serviceAccount:backend-sa@gig-japan-398904.iam.gserviceaccount.com]
google_project_iam_member.backend-sa-roles["roles/secretmanager.secretAccessor"]: Refreshing state... [id=gig-japan-398904/roles/secretmanager.secretAccessor/serviceAccount:backend-sa@gig-japan-398904.iam.gserviceaccount.com]
google_project_iam_member.backend-sa-roles["roles/iam.serviceAccountUser"]: Refreshing state... [id=gig-japan-398904/roles/iam.serviceAccountUser/serviceAccount:backend-sa@gig-japan-398904.iam.gserviceaccount.com]
google_project_iam_member.gitops-sa-binding: Refreshing state... [id=gig-japan-398904/roles/iam.workloadIdentityUser/principal://iam.googleapis.com/projects/139527520332/locations/global/workloadIdentityPools/gitops-github/subject/ikigaikintore/ikigaikintore]
google_iam_workload_identity_pool_provider.gitops-github-pool-provider: Refreshing state... [id=projects/gig-japan-398904/locations/global/workloadIdentityPools/gitops-github/providers/gitops-github-pool]
google_project_iam_member.frontend-sa-roles["roles/iam.serviceAccountTokenCreator"]: Refreshing state... [id=gig-japan-398904/roles/iam.serviceAccountTokenCreator/serviceAccount:frontend-sa@gig-japan-398904.iam.gserviceaccount.com]
google_project_iam_member.frontend-sa-roles["roles/run.developer"]: Refreshing state... [id=gig-japan-398904/roles/run.developer/serviceAccount:frontend-sa@gig-japan-398904.iam.gserviceaccount.com]
google_project_iam_member.frontend-sa-roles["roles/secretmanager.secretAccessor"]: Refreshing state... [id=gig-japan-398904/roles/secretmanager.secretAccessor/serviceAccount:frontend-sa@gig-japan-398904.iam.gserviceaccount.com]
google_project_iam_member.frontend-sa-roles["roles/iam.serviceAccountUser"]: Refreshing state... [id=gig-japan-398904/roles/iam.serviceAccountUser/serviceAccount:frontend-sa@gig-japan-398904.iam.gserviceaccount.com]
google_secret_manager_secret.frontend-secrets["environment"]: Refreshing state... [id=projects/gig-japan-398904/secrets/environment]
google_secret_manager_secret.frontend-secrets["firebase_app_id"]: Refreshing state... [id=projects/gig-japan-398904/secrets/firebase_app_id]
google_secret_manager_secret.frontend-secrets["user_auth"]: Refreshing state... [id=projects/gig-japan-398904/secrets/user_auth]
google_secret_manager_secret.frontend-secrets["base_endpoint"]: Refreshing state... [id=projects/gig-japan-398904/secrets/base_endpoint]
google_secret_manager_secret.frontend-secrets["firebase_messaging_sender_id"]: Refreshing state... [id=projects/gig-japan-398904/secrets/firebase_messaging_sender_id]
google_secret_manager_secret.frontend-secrets["firebase_storage_bucket"]: Refreshing state... [id=projects/gig-japan-398904/secrets/firebase_storage_bucket]
google_secret_manager_secret.frontend-secrets["firebase_auth_domain"]: Refreshing state... [id=projects/gig-japan-398904/secrets/firebase_auth_domain]
google_secret_manager_secret.frontend-secrets["firebase_api_key"]: Refreshing state... [id=projects/gig-japan-398904/secrets/firebase_api_key]
google_secret_manager_secret.frontend-secrets["firebase_project_id"]: Refreshing state... [id=projects/gig-japan-398904/secrets/firebase_project_id]
google_secret_manager_secret.backend-sa-secret["weather_api_key"]: Refreshing state... [id=projects/gig-japan-398904/secrets/weather_api_key]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # google_artifact_registry_repository.artifact-repository will be updated in-place
  ~ resource "google_artifact_registry_repository" "artifact-repository" {
        id               = "projects/gig-japan-398904/locations/asia-northeast1/repositories/ikigai"
        name             = "ikigai"
        # (10 unchanged attributes hidden)

      + docker_config {
          + immutable_tags = false
        }
    }

  # google_project_iam_member.proxy-sa-roles["roles/run.invoker"] will be created
  + resource "google_project_iam_member" "proxy-sa-roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "gig-japan-398904"
      + role    = "roles/run.invoker"
    }

  # google_project_iam_member.proxy-sa-roles["roles/secretsmanager.secretAccessor"] will be created
  + resource "google_project_iam_member" "proxy-sa-roles" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "gig-japan-398904"
      + role    = "roles/secretsmanager.secretAccessor"
    }

  # google_project_service.firebase-apis["firebase.googleapis.com"] will be destroyed
  # (because google_project_service.firebase-apis is not in configuration)
  - resource "google_project_service" "firebase-apis" {
      - disable_on_destroy = true -> null
      - id                 = "gig-japan-398904/firebase.googleapis.com" -> null
      - project            = "gig-japan-398904" -> null
      - service            = "firebase.googleapis.com" -> null
    }

  # google_project_service.firebase-apis["serviceusage.googleapis.com"] will be destroyed
  # (because google_project_service.firebase-apis is not in configuration)
  - resource "google_project_service" "firebase-apis" {
      - disable_on_destroy = true -> null
      - id                 = "gig-japan-398904/serviceusage.googleapis.com" -> null
      - project            = "gig-japan-398904" -> null
      - service            = "serviceusage.googleapis.com" -> null
    }

  # google_project_service.firebase_apis["firebase.googleapis.com"] will be destroyed
  # (because google_project_service.firebase_apis is not in configuration)
  - resource "google_project_service" "firebase_apis" {
      - disable_on_destroy = true -> null
      - id                 = "gig-japan-398904/firebase.googleapis.com" -> null
      - project            = "gig-japan-398904" -> null
      - service            = "firebase.googleapis.com" -> null
    }

  # google_project_service.firebase_apis["serviceusage.googleapis.com"] will be destroyed
  # (because google_project_service.firebase_apis is not in configuration)
  - resource "google_project_service" "firebase_apis" {
      - disable_on_destroy = true -> null
      - id                 = "gig-japan-398904/serviceusage.googleapis.com" -> null
      - project            = "gig-japan-398904" -> null
      - service            = "serviceusage.googleapis.com" -> null
    }

  # google_service_account.proxy-sa will be created
  + resource "google_service_account" "proxy-sa" {
      + account_id   = "proxy-sa"
      + disabled     = false
      + display_name = "proxy-sa"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "gig-japan-398904"
      + unique_id    = (known after apply)
    }

Plan: 3 to add, 1 to change, 4 to destroy.
google_project_service.firebase-apis["firebase.googleapis.com"]: Destroying... [id=gig-japan-398904/firebase.googleapis.com]
google_project_service.firebase_apis["serviceusage.googleapis.com"]: Destroying... [id=gig-japan-398904/serviceusage.googleapis.com]
google_project_service.firebase-apis["serviceusage.googleapis.com"]: Destroying... [id=gig-japan-398904/serviceusage.googleapis.com]
google_project_service.firebase_apis["firebase.googleapis.com"]: Destroying... [id=gig-japan-398904/firebase.googleapis.com]
google_service_account.proxy-sa: Creating...
google_artifact_registry_repository.artifact-repository: Modifying... [id=projects/gig-japan-398904/locations/asia-northeast1/repositories/ikigai]
google_artifact_registry_repository.artifact-repository: Modifications complete after 2s [id=projects/gig-japan-398904/locations/asia-northeast1/repositories/ikigai]
google_service_account.proxy-sa: Creation complete after 2s [id=projects/gig-japan-398904/serviceAccounts/proxy-sa@gig-japan-398904.iam.gserviceaccount.com]
google_project_iam_member.proxy-sa-roles["roles/secretsmanager.secretAccessor"]: Creating...
google_project_iam_member.proxy-sa-roles["roles/run.invoker"]: Creating...
google_project_iam_member.proxy-sa-roles["roles/run.invoker"]: Creation complete after 8s [id=gig-japan-398904/roles/run.invoker/serviceAccount:proxy-sa@gig-japan-398904.iam.gserviceaccount.com]

Error: Error when reading or editing Project Service gig-japan-398904/serviceusage.googleapis.com: Error disabling service "serviceusage.googleapis.com" for project "gig-japan-398904": googleapi: Error 400: The service serviceusage.googleapis.com is depended on by the following active service(s): cloudapis.googleapis.com; Please specify disable_dependent_services=true if you want to proceed with disabling all services.
Help Token: AX4KC-jmraLD8S89wRq3e2-NISifWAf0P3QtloVyWoHfmlVJ1ml1FrW5jNA0ns5rJB5FaDAOQJ_8s7a91i4-uZTWdFFNSBcdZo5Q8GQU0hBCsdYY
Details:
[
  {
    "@type": "type.googleapis.com/google.rpc.PreconditionFailure",
    "violations": [
      {
        "subject": "?error_code=100001\u0026service_name=serviceusage.googleapis.com\u0026services=cloudapis.googleapis.com",
        "type": "googleapis.com"
      }
    ]
  },
  {
    "@type": "type.googleapis.com/google.rpc.ErrorInfo",
    "domain": "serviceusage.googleapis.com",
    "metadata": {
      "service_name": "serviceusage.googleapis.com",
      "services": "cloudapis.googleapis.com"
    },
    "reason": "COMMON_SU_SERVICE_HAS_DEPENDENT_SERVICES"
  }
]
, failedPrecondition


Error: Error when reading or editing Project Service gig-japan-398904/firebase.googleapis.com: Error disabling service "firebase.googleapis.com" for project "gig-japan-398904": googleapi: Error 400: The service firebase.googleapis.com is depended on by the following active service(s): firebasehosting.googleapis.com; Please specify disable_dependent_services=true if you want to proceed with disabling all services.
Help Token: AX4KC-jwtciV7DfQEX29mFEcU_XAkzNqRlXcPdloIPqXvY_9IsoA98LXzLet4X0vsokL2FzwGkbsJ3nSV8_c4iJkvGo4rmlL4B7JK42wP-SCsetG
Details:
[
  {
    "@type": "type.googleapis.com/google.rpc.PreconditionFailure",
    "violations": [
      {
        "subject": "?error_code=100001\u0026service_name=firebase.googleapis.com\u0026services=firebasehosting.googleapis.com",
        "type": "googleapis.com"
      }
    ]
  },
  {
    "@type": "type.googleapis.com/google.rpc.ErrorInfo",
    "domain": "serviceusage.googleapis.com",
    "metadata": {
      "service_name": "firebase.googleapis.com",
      "services": "firebasehosting.googleapis.com"
    },
    "reason": "COMMON_SU_SERVICE_HAS_DEPENDENT_SERVICES"
  }
]
, failedPrecondition


Error: Error when reading or editing Project Service gig-japan-398904/serviceusage.googleapis.com: Error disabling service "serviceusage.googleapis.com" for project "gig-japan-398904": googleapi: Error 400: The service serviceusage.googleapis.com is depended on by the following active service(s): cloudapis.googleapis.com; Please specify disable_dependent_services=true if you want to proceed with disabling all services.
Help Token: AX4KC-jb3vk0Jh4zmgt568iqN3xA9m-J3s_SbQLt9J9gotYuwVeavg_Yh9O7nMgbbM68SSagX7O6NzKCUu-t5z6CAWlzw_hI2BE03BudZEwkjUWq
Details:
[
  {
    "@type": "type.googleapis.com/google.rpc.PreconditionFailure",
    "violations": [
      {
        "subject": "?error_code=100001\u0026service_name=serviceusage.googleapis.com\u0026services=cloudapis.googleapis.com",
        "type": "googleapis.com"
      }
    ]
  },
  {
    "@type": "type.googleapis.com/google.rpc.ErrorInfo",
    "domain": "serviceusage.googleapis.com",
    "metadata": {
      "service_name": "serviceusage.googleapis.com",
      "services": "cloudapis.googleapis.com"
    },
    "reason": "COMMON_SU_SERVICE_HAS_DEPENDENT_SERVICES"
  }
]
, failedPrecondition


Error: Error when reading or editing Project Service gig-japan-398904/firebase.googleapis.com: Error disabling service "firebase.googleapis.com" for project "gig-japan-398904": googleapi: Error 400: The service firebase.googleapis.com is depended on by the following active service(s): firebasehosting.googleapis.com; Please specify disable_dependent_services=true if you want to proceed with disabling all services.
Help Token: AX4KC-hyRYx9iDJCs5ysZHbQutD4sYgJ8dF1kgBs1j3_ta0shUoNSnYIXn4VosbZnC4LL2_3r2aemgQqmisICd9H7lbrClTU1_9G9Io8DVNZKbLx
Details:
[
  {
    "@type": "type.googleapis.com/google.rpc.PreconditionFailure",
    "violations": [
      {
        "subject": "?error_code=100001\u0026service_name=firebase.googleapis.com\u0026services=firebasehosting.googleapis.com",
        "type": "googleapis.com"
      }
    ]
  },
  {
    "@type": "type.googleapis.com/google.rpc.ErrorInfo",
    "domain": "serviceusage.googleapis.com",
    "metadata": {
      "service_name": "firebase.googleapis.com",
      "services": "firebasehosting.googleapis.com"
    },
    "reason": "COMMON_SU_SERVICE_HAS_DEPENDENT_SERVICES"
  }
]
, failedPrecondition


Error: Request `Create IAM Members roles/secretsmanager.secretAccessor serviceAccount:proxy-sa@gig-japan-398904.iam.gserviceaccount.com for project "gig-japan-398904"` returned error: Batch request and retried single request "Create IAM Members roles/secretsmanager.secretAccessor serviceAccount:proxy-sa@gig-japan-398904.iam.gserviceaccount.com for project \"gig-japan-398904\"" both failed. Final error: Error applying IAM policy for project "gig-japan-398904": Error setting IAM policy for project "gig-japan-398904": googleapi: Error 400: Role roles/secretsmanager.secretAccessor is not supported for this resource., badRequest

  with google_project_iam_member.proxy-sa-roles["roles/secretsmanager.secretAccessor"],
  on proxy.tf line 14, in resource "google_project_iam_member" "proxy-sa-roles":
  14: resource "google_project_iam_member" "proxy-sa-roles" {

::debug::Terraform exited with code 1.
::debug::stdout: google_project_service.frontend-api-resources["identitytoolkit.googleapis.com"]: Refreshing state... [id=gig-japan-398904/identitytoolkit.googleapis.com]%0Agoogle_project_service.firebase_apis["serviceusage.googleapis.com"]: Refreshing state... [id=gig-japan-398904/serviceusage.googleapis.com]%0Agoogle_project_service.firebase_apis["firebase.googleapis.com"]: Refreshing state... [id=gig-japan-398904/firebase.googleapis.com]%0Agoogle_project_service.frontend-api-resources["serviceusage.googleapis.com"]: Refreshing state... [id=gig-japan-398904/serviceusage.googleapis.com]%0Agoogle_service_account.gitops-sa: Refreshing state... [id=projects/gig-japan-398904/serviceAccounts/terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_service.firebase-apis["serviceusage.googleapis.com"]: Refreshing state... [id=gig-japan-398904/serviceusage.googleapis.com]%0Agoogle_project_service.firebase-apis["firebase.googleapis.com"]: Refreshing state... [id=gig-japan-398904/firebase.googleapis.com]%0Agoogle_service_account.backend-sa: Refreshing state... [id=projects/gig-japan-398904/serviceAccounts/backend-sa@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_service.frontend-api-resources["firestore.googleapis.com"]: Refreshing state... [id=gig-japan-398904/firestore.googleapis.com]%0Agoogle_storage_bucket.frontend-bucket: Refreshing state... [id=web-iki]%0Agoogle_project_service.api-resources["artifactregistry.googleapis.com"]: Refreshing state... [id=gig-japan-398904/artifactregistry.googleapis.com]%0Agoogle_iam_workload_identity_pool.gitops-github-identity-pool: Refreshing state... [id=projects/gig-japan-398904/locations/global/workloadIdentityPools/gitops-github]%0Agoogle_service_account.frontend-sa: Refreshing state... [id=projects/gig-japan-398904/serviceAccounts/frontend-sa@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_service.backend-api-resources["run.googleapis.com"]: Refreshing state... [id=gig-japan-398904/run.googleapis.com]%0Agoogle_project_iam_member.gitops-sa-roles["roles/artifactregistry.writer"]: Refreshing state... [id=gig-japan-398904/roles/artifactregistry.writer/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_service.backend-api-resources["secretmanager.googleapis.com"]: Refreshing state... [id=gig-japan-398904/secretmanager.googleapis.com]%0Agoogle_artifact_registry_repository.artifact-repository: Refreshing state... [id=projects/gig-japan-398904/locations/asia-northeast1/repositories/ikigai]%0Agoogle_project_iam_member.gitops-sa-roles["roles/iam.workloadIdentityUser"]: Refreshing state... [id=gig-japan-398904/roles/iam.workloadIdentityUser/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.gitops-sa-roles["roles/secretmanager.admin"]: Refreshing state... [id=gig-japan-398904/roles/secretmanager.admin/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.gitops-sa-roles["roles/storage.admin"]: Refreshing state... [id=gig-japan-398904/roles/storage.admin/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.backend-sa-roles["roles/run.developer"]: Refreshing state... [id=gig-japan-398904/roles/run.developer/serviceAccount:backend-sa@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.gitops-sa-roles["roles/editor"]: Refreshing state... [id=gig-japan-398904/roles/editor/serviceAccount:terraform-gitops@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.backend-sa-roles["roles/iam.serviceAccountTokenCreator"]: Refreshing state... [id=gig-japan-398904/roles/iam.serviceAccountTokenCreator/serviceAccount:backend-sa@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.backend-sa-roles["roles/secretmanager.secretAccessor"]: Refreshing state... [id=gig-japan-398904/roles/secretmanager.secretAccessor/serviceAccount:backend-sa@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.backend-sa-roles["roles/iam.serviceAccountUser"]: Refreshing state... [id=gig-japan-398904/roles/iam.serviceAccountUser/serviceAccount:backend-sa@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.gitops-sa-binding: Refreshing state... [id=gig-japan-398904/roles/iam.workloadIdentityUser/principal://iam.googleapis.com/projects/139527520332/locations/global/workloadIdentityPools/gitops-github/subject/ikigaikintore/ikigaikintore]%0Agoogle_iam_workload_identity_pool_provider.gitops-github-pool-provider: Refreshing state... [id=projects/gig-japan-398904/locations/global/workloadIdentityPools/gitops-github/providers/gitops-github-pool]%0Agoogle_project_iam_member.frontend-sa-roles["roles/iam.serviceAccountTokenCreator"]: Refreshing state... [id=gig-japan-398904/roles/iam.serviceAccountTokenCreator/serviceAccount:frontend-sa@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.frontend-sa-roles["roles/run.developer"]: Refreshing state... [id=gig-japan-398904/roles/run.developer/serviceAccount:frontend-sa@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.frontend-sa-roles["roles/secretmanager.secretAccessor"]: Refreshing state... [id=gig-japan-398904/roles/secretmanager.secretAccessor/serviceAccount:frontend-sa@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.frontend-sa-roles["roles/iam.serviceAccountUser"]: Refreshing state... [id=gig-japan-398904/roles/iam.serviceAccountUser/serviceAccount:frontend-sa@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_secret_manager_secret.frontend-secrets["environment"]: Refreshing state... [id=projects/gig-japan-398904/secrets/environment]%0Agoogle_secret_manager_secret.frontend-secrets["firebase_app_id"]: Refreshing state... [id=projects/gig-japan-398904/secrets/firebase_app_id]%0Agoogle_secret_manager_secret.frontend-secrets["user_auth"]: Refreshing state... [id=projects/gig-japan-398904/secrets/user_auth]%0Agoogle_secret_manager_secret.frontend-secrets["base_endpoint"]: Refreshing state... [id=projects/gig-japan-398904/secrets/base_endpoint]%0Agoogle_secret_manager_secret.frontend-secrets["firebase_messaging_sender_id"]: Refreshing state... [id=projects/gig-japan-398904/secrets/firebase_messaging_sender_id]%0Agoogle_secret_manager_secret.frontend-secrets["firebase_storage_bucket"]: Refreshing state... [id=projects/gig-japan-398904/secrets/firebase_storage_bucket]%0Agoogle_secret_manager_secret.frontend-secrets["firebase_auth_domain"]: Refreshing state... [id=projects/gig-japan-398904/secrets/firebase_auth_domain]%0Agoogle_secret_manager_secret.frontend-secrets["firebase_api_key"]: Refreshing state... [id=projects/gig-japan-398904/secrets/firebase_api_key]%0Agoogle_secret_manager_secret.frontend-secrets["firebase_project_id"]: Refreshing state... [id=projects/gig-japan-398904/secrets/firebase_project_id]%0Agoogle_secret_manager_secret.backend-sa-secret["weather_api_key"]: Refreshing state... [id=projects/gig-japan-398904/secrets/weather_api_key]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A  - destroy%0A%0ATerraform will perform the following actions:%0A%0A  # google_artifact_registry_repository.artifact-repository will be updated in-place%0A  ~ resource "google_artifact_registry_repository" "artifact-repository" {%0A        id               = "projects/gig-japan-398904/locations/asia-northeast1/repositories/ikigai"%0A        name             = "ikigai"%0A        # (10 unchanged attributes hidden)%0A%0A      + docker_config {%0A          + immutable_tags = false%0A        }%0A    }%0A%0A  # google_project_iam_member.proxy-sa-roles["roles/run.invoker"] will be created%0A  + resource "google_project_iam_member" "proxy-sa-roles" {%0A      + etag    = (known after apply)%0A      + id      = (known after apply)%0A      + member  = (known after apply)%0A      + project = "gig-japan-398904"%0A      + role    = "roles/run.invoker"%0A    }%0A%0A  # google_project_iam_member.proxy-sa-roles["roles/secretsmanager.secretAccessor"] will be created%0A  + resource "google_project_iam_member" "proxy-sa-roles" {%0A      + etag    = (known after apply)%0A      + id      = (known after apply)%0A      + member  = (known after apply)%0A      + project = "gig-japan-398904"%0A      + role    = "roles/secretsmanager.secretAccessor"%0A    }%0A%0A  # google_project_service.firebase-apis["firebase.googleapis.com"] will be destroyed%0A  # (because google_project_service.firebase-apis is not in configuration)%0A  - resource "google_project_service" "firebase-apis" {%0A      - disable_on_destroy = true -> null%0A      - id                 = "gig-japan-398904/firebase.googleapis.com" -> null%0A      - project            = "gig-japan-398904" -> null%0A      - service            = "firebase.googleapis.com" -> null%0A    }%0A%0A  # google_project_service.firebase-apis["serviceusage.googleapis.com"] will be destroyed%0A  # (because google_project_service.firebase-apis is not in configuration)%0A  - resource "google_project_service" "firebase-apis" {%0A      - disable_on_destroy = true -> null%0A      - id                 = "gig-japan-398904/serviceusage.googleapis.com" -> null%0A      - project            = "gig-japan-398904" -> null%0A      - service            = "serviceusage.googleapis.com" -> null%0A    }%0A%0A  # google_project_service.firebase_apis["firebase.googleapis.com"] will be destroyed%0A  # (because google_project_service.firebase_apis is not in configuration)%0A  - resource "google_project_service" "firebase_apis" {%0A      - disable_on_destroy = true -> null%0A      - id                 = "gig-japan-398904/firebase.googleapis.com" -> null%0A      - project            = "gig-japan-398904" -> null%0A      - service            = "firebase.googleapis.com" -> null%0A    }%0A%0A  # google_project_service.firebase_apis["serviceusage.googleapis.com"] will be destroyed%0A  # (because google_project_service.firebase_apis is not in configuration)%0A  - resource "google_project_service" "firebase_apis" {%0A      - disable_on_destroy = true -> null%0A      - id                 = "gig-japan-398904/serviceusage.googleapis.com" -> null%0A      - project            = "gig-japan-398904" -> null%0A      - service            = "serviceusage.googleapis.com" -> null%0A    }%0A%0A  # google_service_account.proxy-sa will be created%0A  + resource "google_service_account" "proxy-sa" {%0A      + account_id   = "proxy-sa"%0A      + disabled     = false%0A      + display_name = "proxy-sa"%0A      + email        = (known after apply)%0A      + id           = (known after apply)%0A      + member       = (known after apply)%0A      + name         = (known after apply)%0A      + project      = "gig-japan-398904"%0A      + unique_id    = (known after apply)%0A    }%0A%0APlan: 3 to add, 1 to change, 4 to destroy.%0Agoogle_project_service.firebase-apis["firebase.googleapis.com"]: Destroying... [id=gig-japan-398904/firebase.googleapis.com]%0Agoogle_project_service.firebase_apis["serviceusage.googleapis.com"]: Destroying... [id=gig-japan-398904/serviceusage.googleapis.com]%0Agoogle_project_service.firebase-apis["serviceusage.googleapis.com"]: Destroying... [id=gig-japan-398904/serviceusage.googleapis.com]%0Agoogle_project_service.firebase_apis["firebase.googleapis.com"]: Destroying... [id=gig-japan-398904/firebase.googleapis.com]%0Agoogle_service_account.proxy-sa: Creating...%0Agoogle_artifact_registry_repository.artifact-repository: Modifying... [id=projects/gig-japan-398904/locations/asia-northeast1/repositories/ikigai]%0Agoogle_artifact_registry_repository.artifact-repository: Modifications complete after 2s [id=projects/gig-japan-398904/locations/asia-northeast1/repositories/ikigai]%0Agoogle_service_account.proxy-sa: Creation complete after 2s [id=projects/gig-japan-398904/serviceAccounts/proxy-sa@gig-japan-398904.iam.gserviceaccount.com]%0Agoogle_project_iam_member.proxy-sa-roles["roles/secretsmanager.secretAccessor"]: Creating...%0Agoogle_project_iam_member.proxy-sa-roles["roles/run.invoker"]: Creating...%0Agoogle_project_iam_member.proxy-sa-roles["roles/run.invoker"]: Creation complete after 8s [id=gig-japan-398904/roles/run.invoker/serviceAccount:proxy-sa@gig-japan-398904.iam.gserviceaccount.com]%0A
::debug::stderr: %0AError: Error when reading or editing Project Service gig-japan-398904/serviceusage.googleapis.com: Error disabling service "serviceusage.googleapis.com" for project "gig-japan-398904": googleapi: Error 400: The service serviceusage.googleapis.com is depended on by the following active service(s): cloudapis.googleapis.com; Please specify disable_dependent_services=true if you want to proceed with disabling all services.%0AHelp Token: AX4KC-jmraLD8S89wRq3e2-NISifWAf0P3QtloVyWoHfmlVJ1ml1FrW5jNA0ns5rJB5FaDAOQJ_8s7a91i4-uZTWdFFNSBcdZo5Q8GQU0hBCsdYY%0ADetails:%0A[%0A  {%0A    "@type": "type.googleapis.com/google.rpc.PreconditionFailure",%0A    "violations": [%0A      {%0A        "subject": "?error_code=100001\u0026service_name=serviceusage.googleapis.com\u0026services=cloudapis.googleapis.com",%0A        "type": "googleapis.com"%0A      }%0A    ]%0A  },%0A  {%0A    "@type": "type.googleapis.com/google.rpc.ErrorInfo",%0A    "domain": "serviceusage.googleapis.com",%0A    "metadata": {%0A      "service_name": "serviceusage.googleapis.com",%0A      "services": "cloudapis.googleapis.com"%0A    },%0A    "reason": "COMMON_SU_SERVICE_HAS_DEPENDENT_SERVICES"%0A  }%0A]%0A, failedPrecondition%0A%0A%0AError: Error when reading or editing Project Service gig-japan-398904/firebase.googleapis.com: Error disabling service "firebase.googleapis.com" for project "gig-japan-398904": googleapi: Error 400: The service firebase.googleapis.com is depended on by the following active service(s): firebasehosting.googleapis.com; Please specify disable_dependent_services=true if you want to proceed with disabling all services.%0AHelp Token: AX4KC-jwtciV7DfQEX29mFEcU_XAkzNqRlXcPdloIPqXvY_9IsoA98LXzLet4X0vsokL2FzwGkbsJ3nSV8_c4iJkvGo4rmlL4B7JK42wP-SCsetG%0ADetails:%0A[%0A  {%0A    "@type": "type.googleapis.com/google.rpc.PreconditionFailure",%0A    "violations": [%0A      {%0A        "subject": "?error_code=100001\u0026service_name=firebase.googleapis.com\u0026services=firebasehosting.googleapis.com",%0A        "type": "googleapis.com"%0A      }%0A    ]%0A  },%0A  {%0A    "@type": "type.googleapis.com/google.rpc.ErrorInfo",%0A    "domain": "serviceusage.googleapis.com",%0A    "metadata": {%0A      "service_name": "firebase.googleapis.com",%0A      "services": "firebasehosting.googleapis.com"%0A    },%0A    "reason": "COMMON_SU_SERVICE_HAS_DEPENDENT_SERVICES"%0A  }%0A]%0A, failedPrecondition%0A%0A%0AError: Error when reading or editing Project Service gig-japan-398904/serviceusage.googleapis.com: Error disabling service "serviceusage.googleapis.com" for project "gig-japan-398904": googleapi: Error 400: The service serviceusage.googleapis.com is depended on by the following active service(s): cloudapis.googleapis.com; Please specify disable_dependent_services=true if you want to proceed with disabling all services.%0AHelp Token: AX4KC-jb3vk0Jh4zmgt568iqN3xA9m-J3s_SbQLt9J9gotYuwVeavg_Yh9O7nMgbbM68SSagX7O6NzKCUu-t5z6CAWlzw_hI2BE03BudZEwkjUWq%0ADetails:%0A[%0A  {%0A    "@type": "type.googleapis.com/google.rpc.PreconditionFailure",%0A    "violations": [%0A      {%0A        "subject": "?error_code=100001\u0026service_name=serviceusage.googleapis.com\u0026services=cloudapis.googleapis.com",%0A        "type": "googleapis.com"%0A      }%0A    ]%0A  },%0A  {%0A    "@type": "type.googleapis.com/google.rpc.ErrorInfo",%0A    "domain": "serviceusage.googleapis.com",%0A    "metadata": {%0A      "service_name": "serviceusage.googleapis.com",%0A      "services": "cloudapis.googleapis.com"%0A    },%0A    "reason": "COMMON_SU_SERVICE_HAS_DEPENDENT_SERVICES"%0A  }%0A]%0A, failedPrecondition%0A%0A%0AError: Error when reading or editing Project Service gig-japan-398904/firebase.googleapis.com: Error disabling service "firebase.googleapis.com" for project "gig-japan-398904": googleapi: Error 400: The service firebase.googleapis.com is depended on by the following active service(s): firebasehosting.googleapis.com; Please specify disable_dependent_services=true if you want to proceed with disabling all services.%0AHelp Token: AX4KC-hyRYx9iDJCs5ysZHbQutD4sYgJ8dF1kgBs1j3_ta0shUoNSnYIXn4VosbZnC4LL2_3r2aemgQqmisICd9H7lbrClTU1_9G9Io8DVNZKbLx%0ADetails:%0A[%0A  {%0A    "@type": "type.googleapis.com/google.rpc.PreconditionFailure",%0A    "violations": [%0A      {%0A        "subject": "?error_code=100001\u0026service_name=firebase.googleapis.com\u0026services=firebasehosting.googleapis.com",%0A        "type": "googleapis.com"%0A      }%0A    ]%0A  },%0A  {%0A    "@type": "type.googleapis.com/google.rpc.ErrorInfo",%0A    "domain": "serviceusage.googleapis.com",%0A    "metadata": {%0A      "service_name": "firebase.googleapis.com",%0A      "services": "firebasehosting.googleapis.com"%0A    },%0A    "reason": "COMMON_SU_SERVICE_HAS_DEPENDENT_SERVICES"%0A  }%0A]%0A, failedPrecondition%0A%0A%0AError: Request `Create IAM Members roles/secretsmanager.secretAccessor serviceAccount:proxy-sa@gig-japan-398904.iam.gserviceaccount.com for project "gig-japan-398904"` returned error: Batch request and retried single request "Create IAM Members roles/secretsmanager.secretAccessor serviceAccount:proxy-sa@gig-japan-398904.iam.gserviceaccount.com for project \"gig-japan-398904\"" both failed. Final error: Error applying IAM policy for project "gig-japan-398904": Error setting IAM policy for project "gig-japan-398904": googleapi: Error 400: Role roles/secretsmanager.secretAccessor is not supported for this resource., badRequest%0A%0A  with google_project_iam_member.proxy-sa-roles["roles/secretsmanager.secretAccessor"],%0A  on proxy.tf line 14, in resource "google_project_iam_member" "proxy-sa-roles":%0A  14: resource "google_project_iam_member" "proxy-sa-roles" {%0A%0A
::debug::exitcode: 1
::error::Terraform exited with code 1.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform_apply","PRNumber":84,"Program":"tfcmt","SHA1":"11b37440f707f292e1e692746e8040a71702560e","Vars":{},"WorkflowName":"iaac_apply"} -->